0.57.2119-1/InformationRegisters/ККСНГ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/InformationRegisters/ККСНГ_Настройки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КаталогВыгрузкиРасширенногоЭкспорта

// Устанавливает каталог выгрузки архивов документов при расширенном экспорте.
//
// Параметры:
//  НовыйКаталог - Строка	 - Устанавливаемый каталог выгрузки архивов документов при расширенном экспорте.
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Успешность установки каталог выгрузки.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция УстановитьКаталогВыгрузкиРасширенногоЭкспорта(НовыйКаталог) Экспорт
	
	ШаблонЗаголовка = "Установка каталог выгрузки архивов документов при расширенном экспорте в значение %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, НовыйКаталог);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ДопустимыйТип = Тип("Строка");
	ЗапросКорректностиНовогоКаталога = КорректностьТипаПараметра(НовыйКаталог, ДопустимыйТип);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКорректностиНовогоКаталога.Журнал, Ложь);
	Если Не ЗапросКорректностиНовогоКаталога.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	МаксДопустимаяДлинаПути = 160;
	Если СтрДлина(НовыйКаталог) > МаксДопустимаяДлинаПути Тогда
		ТекстШаблона = "Превышена допустимая длина пути %1.";
		СобытиеОшибки = СтрШаблон(ТекстШаблона, МаксДопустимаяДлинаПути);
		КодОшибки = "MXL-00004";
		ТекстШаблона = "Для установки каталога выгрузки доступна максимальная длина пути %1. Передан путь длиной %2.";
		КомментарийОшибки = СтрШаблон(ТекстШаблона, Строка(МаксДопустимаяДлинаПути), Строка(СтрДлина(НовыйКаталог)));
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	ЗапросУстановкиКаталога = УстановитьЗначение(НовыйКаталог, УИД_КаталогВыгрузкиРасширенногоЭкспорта());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиКаталога.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиКаталога.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущий режим каталог выгрузки архивов документов при расширенном экспорте.
// 
// Возвращаемое значение:
//  Строка - Текущий каталог выгрузки архивов документов при расширенном экспорте.
//
Функция КаталогВыгрузкиРасширенногоЭкспорта() Экспорт
	
	ЗапросТекущегоКаталога = ПолучитьЗначение(УИД_КаталогВыгрузкиРасширенногоЭкспорта());
	Если ЗапросТекущегоКаталога.Успех Тогда
		ТекущийКаталог = ЗапросТекущегоКаталога.Результат;
	Иначе
		ТекущийКаталог = "";
	КонецЕсли;
	Возврат ТекущийКаталог;
	
КонецФункции

#КонецОбласти

#Область ГруппировкаРасширенногоЭкспорта

// Устанавливает вариант группировки архивов документов при расширенном экспорте.
//
// Параметры:
//  НоваяГруппировка - 	 - 
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Успешность установки группировки.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция УстановитьГруппировкуРасширенногоЭкспорта(НоваяГруппировка) Экспорт
	
	ШаблонЗаголовка = "Установка варианта группировки архивов документов при расширенном экспорте в значение %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, НоваяГруппировка);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ПоддерживаемыеГруппировки = ПоддерживаемыеГруппировкиРасширенногоЭкспорта();
	Если ПоддерживаемыеГруппировки.Найти(НоваяГруппировка) = Неопределено Тогда
		ШаблонСобытия = "Некорректное значение устанавливаемой группировки расширенного экспорта: %1.";
		СобытиеОшибки = СтрШаблон((ШаблонСобытия), НоваяГруппировка);
		КодОшибки = "SETT-00004";
		КомментарийОшибки = "Значение устанавливаемой группировки не входит в список поддерживаемых вариантов группировки.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	ЗапросУстановкиГруппировки = УстановитьЗначение(НоваяГруппировка, УИД_ГруппировкаРасширенногоЭкспорта());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиГруппировки.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиГруппировки.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущий вариант группировки архивов документов при расширенном экспорте.
// 
// Возвращаемое значение:
//  Строка - Текущий вариант группировки (см. ПоддерживаемыеГруппировкиРасширенногоЭкспорта()).
//
Функция ГруппировкаРасширенногоЭкспорта() Экспорт
	
	ПоддерживаемыеГруппировки = ПоддерживаемыеГруппировкиРасширенногоЭкспорта();
	Если ПоддерживаемыеГруппировки.Количество() > 0 Тогда
		ТекущаяГруппировка = ПоддерживаемыеГруппировки[0];
	Иначе
		ТекущаяГруппировка = "";
	КонецЕсли;
	
	ЗапросТекущейГруппировки = ПолучитьЗначение(УИД_ГруппировкаРасширенногоЭкспорта());
	Если ЗапросТекущейГруппировки.Успех Тогда
		ХранимаяГруппировка = ЗапросТекущейГруппировки.Результат;
		Если ПоддерживаемыеГруппировки.Найти(ХранимаяГруппировка) <> Неопределено Тогда
			ТекущаяГруппировка = ХранимаяГруппировка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущаяГруппировка;
	
КонецФункции

#КонецОбласти

#Область ТипыДокументовРасширенногоЭкспорта

// Устанавливает вариант группировки архивов документов при расширенном экспорте.
//
// Параметры:
//  НовыйСписок	 - 	 - 
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Успешность установки группировки.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция УстановитьТипыДокументовРасширенногоЭкспорта(НовыйСписок) Экспорт
	
	ШаблонЗаголовка = "Установка типов документов при расширенном экспорте: %1.";
	ПредставлениеСписка = СтрСоединить(НовыйСписок.ВыгрузитьЗначения(), ", ");
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, ПредставлениеСписка);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ПоддерживаемыеТипыДокументов = ПоддерживаемыеТипыДокументовРасширенногоЭкспорта();
	НекорректныеТипыДокументов = Новый Массив;
	Для Каждого ТекЭлемент Из НовыйСписок Цикл
		ТекТипДокумента = ТекЭлемент.Значение;
		НайденныйТипДокумента = ПоддерживаемыеТипыДокументов.Найти(ТекТипДокумента);
		Если НайденныйТипДокумента = Неопределено Тогда
			НекорректныеТипыДокументов.Добавить(ТекТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если НекорректныеТипыДокументов.Количество() > 0 Тогда
		ШаблонСобытия = "Некорректные устанавливаемые типы документов расширенного экспорта: %1.";
		ПредставлениеНекорректных = СтрСоединить(НекорректныеТипыДокументов, ", ");
		СобытиеОшибки = СтрШаблон((ШаблонСобытия), ПредставлениеНекорректных);
		КодОшибки = "SETT-00005";
		КомментарийОшибки = "Значения устанавливаемых типов документов не входят в список поддерживаемых типов документов.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	ЗапросУстановкиСписка = УстановитьЗначение(НовыйСписок, УИД_ТипыДокументовРасширенногоЭкспорта());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиСписка.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиСписка.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущий список типов документов при расширенном экспорте.
//
// Параметры:
//  ВернутьИзСохраненнойНастройки	 - 	 - 
// 
// Возвращаемое значение:
//  СписокЗначений - Текущий список типов документов (см. ПоддерживаемыеТипыДокументовРасширенногоЭкспорта()).
//
Функция ТипыДокументовРасширенногоЭкспорта(ВернутьИзСохраненнойНастройки = Истина) Экспорт
	
	ПоддерживаемыеТипыДокументов = ПоддерживаемыеТипыДокументовРасширенногоЭкспорта();
	
	ЗапросТекущегоСписка = ПолучитьЗначение(УИД_ТипыДокументовРасширенногоЭкспорта());
	Если Не ЗапросТекущегоСписка.Успех ИЛИ ВернутьИзСохраненнойНастройки = Ложь Тогда
		ТекущийСписок = Новый СписокЗначений;
		ТекущийСписок.ЗагрузитьЗначения(ПоддерживаемыеТипыДокументов);
		ТекущийСписок.ЗаполнитьПометки(Истина);
		Возврат ТекущийСписок;
	КонецЕсли;
	
	ТекущийСписок = ЗапросТекущегоСписка.Результат;
	
	ЭлементыКУдалению = Новый Массив;
	Для Каждого ТекЭлемент Из ТекущийСписок Цикл
		НайденныйТипДокумента = ПоддерживаемыеТипыДокументов.Найти(ТекЭлемент.Значение);
		Если НайденныйТипДокумента = Неопределено Тогда
			ЭлементыКУдалению.Добавить(ТекЭлемент);
		Иначе
			ПоддерживаемыеТипыДокументов.Удалить(НайденныйТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из ЭлементыКУдалению Цикл
		ТекущийСписок.Удалить(ТекЭлемент);
	КонецЦикла;
	
	Для Каждого ТекТипДокумента Из ПоддерживаемыеТипыДокументов Цикл
		ТекущийСписок.Добавить(ТекТипДокумента);
	КонецЦикла;
	
	Возврат ТекущийСписок;
	
КонецФункции

// Возвращает краткое представление типа документа
//
// Параметры:
//  ПолноеПредставление	 - Строка	 - тип документа:
//  	"УПД:Первичный документ" - УПД ДОП;
//  	"УПД:Счет-фактура" - УПД СЧФ;
//  	"УПД:Счет-фактура и первичный документ" - УПД СЧФДОП;
//  	"УКД:Первичный документ" - УКД ДОП;
//  	"УКД:Корректировочный счет-фактура" - УКД КСЧФ;
//  	"УКД:Корректировочный счет-фактура и первичный документ" - УКД КСЧФДОП;
// 
// Возвращаемое значение:
//  Строка - пустая строка либо одно из "UPD_DOP"/"UPD_SF"/"UPD_SF_DOP"/"UCD_DIC"/"UCD_CSF"/"UCD_CSF_DIC"
//
Функция КраткоеПредставлениеТипаДокумента(ПолноеПредставление) Экспорт
	
	СоответствиеТипамДокументов = Новый Соответствие;
	СоответствиеТипамДокументов.Вставить("УПД:Первичный документ", "UPD_DOP");
	СоответствиеТипамДокументов.Вставить("УПД:Счет-фактура", "UPD_SF");
	СоответствиеТипамДокументов.Вставить("УПД:Счет-фактура и первичный документ", "UPD_SF_DOP");
	СоответствиеТипамДокументов.Вставить("УКД:Первичный документ", "UCD_DIC");
	СоответствиеТипамДокументов.Вставить("УКД:Корректировочный счет-фактура", "UCD_CSF");
	СоответствиеТипамДокументов.Вставить("УКД:Корректировочный счет-фактура и первичный документ", "UCD_CSF_DIC");
	
	КраткоеПредставление = СоответствиеТипамДокументов.Получить(ПолноеПредставление);
	Если КраткоеПредставление = Неопределено Тогда
		Возврат ПолноеПредставление;
	Иначе
		Возврат КраткоеПредставление;
	КонецЕсли;
	
КонецФункции

// Возвращает полное представление типа документа
//
// Параметры:
//  КраткоеПредставление - Строка	 - тип документа:
//  	"UPD_DOP"/"UPD_SF"/"UPD_SF_DOP"/"UCD_DIC"/"UCD_CSF"/"UCD_CSF_DIC"
// 
// Возвращаемое значение:
//  Строка - представление типа документа:
//  "УПД:Первичный документ" - УПД ДОП;
//  "УПД:Счет-фактура" - УПД СЧФ;
//  "УПД:Счет-фактура и первичный документ" - УПД СЧФДОП;
//  "УКД:Первичный документ" - УКД ДОП;
//  "УКД:Корректировочный счет-фактура" - УКД КСЧФ;
//  "УКД:Корректировочный счет-фактура и первичный документ" - УКД КСЧФДОП;
//
Функция ПолноеПредставлениеТипаДокумента(КраткоеПредставление) Экспорт
	
	СоответствиеТипамДокументов = Новый Соответствие;
	СоответствиеТипамДокументов.Вставить("UPD_DOP", "УПД:Первичный документ");
	СоответствиеТипамДокументов.Вставить("UPD_SF", "УПД:Счет-фактура");
	СоответствиеТипамДокументов.Вставить("UPD_SF_DOP", "УПД:Счет-фактура и первичный документ");
	СоответствиеТипамДокументов.Вставить("UCD_DIC", "УКД:Первичный документ");
	СоответствиеТипамДокументов.Вставить("UCD_CSF", "УКД:Корректировочный счет-фактура");
	СоответствиеТипамДокументов.Вставить("UCD_CSF_DIC", "УКД:Корректировочный счет-фактура и первичный документ");
	
	ПолноеПредставление = СоответствиеТипамДокументов.Получить(КраткоеПредставление);
	Если  ПолноеПредставление = Неопределено Тогда
		Возврат КраткоеПредставление;
	Иначе
		Возврат ПолноеПредставление;
	КонецЕсли;
	
КонецФункции

// Возвращает сокращенное представление типа документа.
//
// Параметры:
//  ТипДокумента - Строка	 - 
// 
// Возвращаемое значение:
//  Строка - Сокращенное представление типа документа.
//  Пример: СокращенноеПредставлениеТипаДокумента(UPD_SF) ==> "УПД.СЧФ"
//
Функция СокращенноеПредставлениеТипаДокумента(ТипДокумента) Экспорт
	
	СоответствиеТипамДокументов = Новый Соответствие;
	СоответствиеТипамДокументов.Вставить("UPD_DOP", "УПД.ДОП");
	СоответствиеТипамДокументов.Вставить("UPD_SF", "УПД.СЧФ");
	СоответствиеТипамДокументов.Вставить("UPD_SF_DOP", "УПД.СЧФДОП");
	СоответствиеТипамДокументов.Вставить("UCD_CSF", "УКД.КСЧФ");
	СоответствиеТипамДокументов.Вставить("UCD_DIC",	"УКД.ДИС");
	СоответствиеТипамДокументов.Вставить("UCD_CSF_DIC", "УКД.КСЧФДИС");
	
	Представление = СоответствиеТипамДокументов.Получить(ТипДокумента);
	Если Не Представление = Неопределено Тогда
		Возврат Представление;
	Иначе
		Возврат ТипДокумента;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОтправкаЧерновиковЭДО

// Устанавливает настройку использования независимой отправки черновиков при расширенной отправке ДО.
//
// Параметры:
//  Использование	 - Булево	 - Устанавливаемый признак использования.
// 
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета().
//
Функция УстановитьИспользованиеОтправкиЧерновиков(Использование) Экспорт
	
	ШаблонЗаголовка = "Установка признака использования возможности отправки черновиков в значение %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, Использование);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ЗапросУстановкиЗначения = УстановитьЗначение(Использование, УИД_ИспользованиеОтправкиЧерновиков());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиЗначения.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиЗначения.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущее значение настройки использования незавизимой отправки черновика при расширенной отправке ДО.
// 
// Возвращаемое значение:
//   - Булево - текущее значение настройки.
//
Функция ИспользуетсяОтправкаЧерновиков() Экспорт
	
	ЗапросТекущегоЗначения = ПолучитьЗначение(УИД_ИспользованиеОтправкиЧерновиков());
	ТекущееЗначение = ?(ЗапросТекущегоЗначения.Результат = Неопределено, Ложь, ЗапросТекущегоЗначения.Результат);
	
	Возврат ТекущееЗначение;
	
КонецФункции

#КонецОбласти

#Область РаботаПоБизнесПроцессуУВХД

// Устанавливает настройку использования для работы по бизнес-процессу УВХД.
//
// Параметры:
//  Использование	 - Булево	 - Устанавливаемый признак использования.
// 
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета().
//
Функция УстановитьИспользованиеБизнесПроцессаУВХД(Использование) Экспорт
	
	ШаблонЗаголовка = "Установка признака использования возможности работы по бизнес-процессу ЭДО с поставщиками %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, Использование);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ЗапросУстановкиЗначения = УстановитьЗначение(Использование, УИД_ИспользованиеБизнесПроцессаУВХД());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиЗначения.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиЗначения.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущее значение настройки использования по работе по бизнес-процессу УВХД.
// 
// Возвращаемое значение:
//   - Булево - текущее значение настройки.
//
Функция ИспользуетсяБизнесПроцессУВХД() Экспорт
	
	ЗапросТекущегоЗначения = ПолучитьЗначение(УИД_ИспользованиеБизнесПроцессаУВХД());
	ТекущееЗначение = ?(ЗапросТекущегоЗначения.Результат = Неопределено, Ложь, ЗапросТекущегоЗначения.Результат);
	
	Возврат ТекущееЗначение;
	
КонецФункции

#КонецОбласти

#Область ПроксиСервер

// Сохраняет настройки прокси-сервера.
//
// Параметры:
//  НастройкиПроксиСервера	 - 	 - 
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Результат сохранения параметров.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция СохранитьНастройкиПроксиСервера(Знач НастройкиПроксиСервера) Экспорт
	
	ЗаголовокЖурнала = "Сохранение настроек прокси-сервера";
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ЗапросСохраненияНастройки = УстановитьЗначение(НастройкиПроксиСервера, УИД_НастройкаПроксиСервера());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСохраненияНастройки.Журнал, Ложь);
	Ответ.Успех = ЗапросСохраненияНастройки.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает текущие настройки прокси-сервера.
// 
// Возвращаемое значение:
//   - Соответствие - Текущие настройки прокси-сервера
//
Функция НастройкиПроксиСервера() Экспорт
	
	ЗапросТекущиеНастройки = ПолучитьЗначение(УИД_НастройкаПроксиСервера());
	Возврат ЗапросТекущиеНастройки.Результат;
	
КонецФункции

#КонецОбласти

#Область МашиночитаемыеДоверенности

// Сохраняет таблицу настроек МЧД.
//
// Параметры:
//  НоваяТаблицаЗначений - 	 - Таблица значений довренностей
//  ОрганизацияЭДО		 - 	 - ККСНГ_Организации
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Результат сохранения таблицы.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция СохранитьТаблицуДоверенностей(НоваяТаблицаЗначений, ОрганизацияЭДО) Экспорт
	
	ШаблонЗаголовка = "Сохранение настроек по МЧД: %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, ОрганизацияЭДО);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ЗначениеНастройкиМЧД = ПолучитьЗначение(УИД_НастройкаМЧД());
	СоответствиеНастройкиМЧД = ЗначениеНастройкиМЧД.Результат;
	
	Если ТипЗнч(СоответствиеНастройкиМЧД) = Тип("Соответствие") Тогда
		СоответствиеНастройкиМЧД.Вставить(ОрганизацияЭДО, НоваяТаблицаЗначений);
	Иначе
		СоответствиеНастройкиМЧД = Новый Соответствие;
		СоответствиеНастройкиМЧД.Вставить(ОрганизацияЭДО, НоваяТаблицаЗначений);
	КонецЕсли;
	
	ЗапросСохраненияНастроекМЧД = УстановитьЗначение(СоответствиеНастройкиМЧД, УИД_НастройкаМЧД());
	
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСохраненияНастроекМЧД.Журнал, Ложь);
	Ответ.Успех = ЗапросСохраненияНастроекМЧД.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Получает таблицу настроек МЧД.
//
// Параметры:
//  ОрганизацияЭДО	 - 	 - ККСНГ_Организации
// 
// Возвращаемое значение:
//  ТаблицаМЧД - ТаблицаЗначений
//
Функция ПолучитьТаблицуДоверенностей(ОрганизацияЭДО) Экспорт
	
	Перем ТаблицаМЧД;
	
	ШаблонЗаголовка = "Запись настроек по МЧД %1.";
	ЗаголовокЖурнала = СтрШаблон(ШаблонЗаголовка, Строка(ОрганизацияЭДО));
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ЗначениеНастройкиМЧД = ПолучитьЗначение(УИД_НастройкаМЧД());
	СоответствиеНастройкиМЧД = ЗначениеНастройкиМЧД.Результат;
	
	Если ЗначениеНастройкиМЧД.Успех И ЗначениеЗаполнено(СоответствиеНастройкиМЧД) Тогда
		ТаблицаМЧД = СоответствиеНастройкиМЧД.Получить(ОрганизацияЭДО);
	КонецЕсли;
	
	Возврат ТаблицаМЧД;
	
КонецФункции

#КонецОбласти

#Область ПоискКонтрагентов

// Сохраняет настройку поиска контрагентов для синхронизации с Курьером.
//
// Параметры:
//  Настройка	 - НастройкиКомпоновкиДанных - настройка поиска контрагентов
// 
// Возвращаемое значение:
//  Булево - Признак успеха операции
//
Функция СохранитьНастройкуПоискаКонтрагентов(Настройка) Экспорт
	
	Перем СохранениеНастройки;
	
	СохранениеНастройки = УстановитьЗначение(Настройка, УИД_НастройкаПоискаКонтрагентов());
	Возврат СохранениеНастройки.Успех;
	
КонецФункции

// Получает настройку поиска контрагентов для синхронизации с Курьером.
// 
// Возвращаемое значение:
//  НастройкиКомпоновкиДанных, Неопределено - настройка поиска контрагентов
//
Функция ПолучитьНастройкуПоискаКонтрагентов() Экспорт
	
	Перем ПолучениеНастройки, Настройка;
	
	ПолучениеНастройки = ПолучитьЗначение(УИД_НастройкаПоискаКонтрагентов());
	Если ПолучениеНастройки.Успех Тогда
		Настройка = ПолучениеНастройки.Результат;
		Если ТипЗнч(Настройка) <> Тип("НастройкиКомпоновкиДанных") Тогда
			Настройка = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает значение настройки.
//
// Параметры:
//  НовоеЗначение	 - Произвольный			 - Значение настройки.
//  Идентификатор	 - УникальныйИдентификатор	 - Уникальный идентификатор настройки.
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Успешность установки значения.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция УстановитьЗначение(НовоеЗначение, Идентификатор) Экспорт
	
	СинонимРС = Метаданные.РегистрыСведений.ККСНГ_Настройки.Синоним;
	ТекстШаблона = "Установка значения %1 с идентификатором %2 в регистре сведений %3.";
	ЗаголовокЖурнала = СтрШаблон(ТекстШаблона, НовоеЗначение, Идентификатор, СинонимРС);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ДопустимыйТип = Тип("УникальныйИдентификатор");
	ЗапросКорректностиИдентификатора = КорректностьТипаПараметра(Идентификатор, ДопустимыйТип);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКорректностиИдентификатора.Журнал, Ложь);
	Если Не ЗапросКорректностиИдентификатора.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = Идентификатор;
		
		АлгоритмСжатия = Новый СжатиеДанных(9);
		ЗаписываемоеЗначение = Новый ХранилищеЗначения(НовоеЗначение, АлгоритмСжатия);
		МенеджерЗаписи.Значение = ЗаписываемоеЗначение;
		
		МенеджерЗаписи.ТипЗначения = ТипЗнч(НовоеЗначение);
		МенеджерЗаписи.Записать();
		
		Ответ.Успех = Истина;
		
	Исключение
		ТекстШаблона = "Ошибка установки значения %1 с идентификатором %2 в регистре сведений %3.";
		СобытиеОшибки = СтрШаблон(ТекстШаблона, НовоеЗначение, Идентификатор, СинонимРС);
		КодОшибки = "SETT-00001";
		КомментарийОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

// Получает значение настройки по уникальному идентификатору.
//
// Параметры:
//  Идентификатор	 - УникальныйИдентификатор	 - Уникальный идентификатор настройки.
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Произвольный - Значение настройки.
//  * Успех       - Булево    - Успешность получения значения.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция ПолучитьЗначение(Идентификатор) Экспорт
	
	СинонимРС = Метаданные.РегистрыСведений.ККСНГ_Настройки.Синоним;
	ТекстШаблона = "Получение значения с идентификатором %1 в регистре сведений %2.";
	ЗаголовокЖурнала = СтрШаблон(ТекстШаблона, Идентификатор, СинонимРС);
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ДопустимыйТип = Тип("УникальныйИдентификатор");
	ЗапросКорректностиИдентификатора = КорректностьТипаПараметра(Идентификатор, ДопустимыйТип);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКорректностиИдентификатора.Журнал, Ложь);
	Если Не ЗапросКорректностиИдентификатора.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ККСНГ_Настройки.Значение КАК Значение,
	|	ККСНГ_Настройки.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.ККСНГ_Настройки КАК ККСНГ_Настройки
	|ГДЕ
	|	ККСНГ_Настройки.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Ответ.Результат = ВыборкаДетальныеЗаписи.Значение.Получить();
		Ответ.Успех = Истина;
	Иначе
		ТекстШаблона = "Отсутствует значение с идентификатором %1 в регистре сведений %2.";
		СобытиеОшибки = СтрШаблон(ТекстШаблона,
		Идентификатор, СинонимРС);
		КодОшибки = "SETT-00002";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, "");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

// Проверяет наличие настройки по уникальному идентификатору.
//
// Параметры:
//  Идентификатор	 - УникальныйИдентификатор	 - Уникальный идентификатор настройки.
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Булево - Признак наличия настройки.
//  * Успех       - Булево    - Успешность получения значения.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция ПроверитьНаличиеНастройки(Идентификатор) Экспорт
	
	СинонимРС = Метаданные.РегистрыСведений.ККСНГ_Настройки.Синоним;
	ТекстШаблона = "Проверка наличия настройки с идентификатором %1 в регистре сведений %2.";
	ЗаголовокЖурнала = СтрШаблон(ТекстШаблона, Идентификатор, СинонимРС);
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ДопустимыйТип = Тип("УникальныйИдентификатор");
	ЗапросКорректностиИдентификатора = КорректностьТипаПараметра(Идентификатор, ДопустимыйТип);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКорректностиИдентификатора.Журнал, Ложь);
	Если Не ЗапросКорректностиИдентификатора.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ККСНГ_Настройки.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ККСНГ_Настройки КАК ККСНГ_Настройки
	|ГДЕ
	|	ККСНГ_Настройки.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Ответ.Результат = Не Запрос.Выполнить().Пустой();
	Ответ.Успех = Истина;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

#Область ИдентификаторыНастроек

// Возвращает уникальный идентификатор настройки "Каталог выгрузки расширенного экспорта".
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки "Каталог выгрузки расширенного экспорта".
//
Функция УИД_КаталогВыгрузкиРасширенногоЭкспорта() Экспорт
	
	Возврат Новый УникальныйИдентификатор("6cad66bd-0e0e-46ca-9420-2ecc370a523e");
	
КонецФункции

// Возвращает уникальный идентификатор настройки "Группировка расширенного экспорта".
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки "Группировка расширенного экспорта".
//
Функция УИД_ГруппировкаРасширенногоЭкспорта() Экспорт
	
	Возврат Новый УникальныйИдентификатор("1cb08698-a9b3-4c07-b424-a14f0681c849");
	
КонецФункции

// Возвращает уникальный идентификатор настройки "Типы документов расширенного экспорта".
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки "Типы документов расширенного экспорта".
//
Функция УИД_ТипыДокументовРасширенногоЭкспорта() Экспорт
	
	Возврат Новый УникальныйИдентификатор("02995adc-9b37-4fdf-bf02-58327e43f78d");
	
КонецФункции

// Возвращает уникальный идентификатор настройки "Используется отправка черновиков".
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки.
//
Функция УИД_ИспользованиеОтправкиЧерновиков() Экспорт
	
	Возврат Новый УникальныйИдентификатор("58B784B1-1ADD-45AC-9F1F-9D362CA299B4");
	
КонецФункции

// Возвращает уникальный идентификатор настройки "Используется работа по бизнес-процессу УВХД".
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки.
//
Функция УИД_ИспользованиеБизнесПроцессаУВХД() Экспорт
	
	Возврат Новый УникальныйИдентификатор("EB71B569-C237-4962-8034-8E313B9A422F");
	
КонецФункции

// Возвращает уникальный идентификатор хранения настройки прокси-сервера.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки.
//
Функция УИД_НастройкаПроксиСервера() Экспорт
	
	Возврат Новый УникальныйИдентификатор("573A66A2-05FD-465A-BAA7-B4509E355293");
	
КонецФункции

// Возвращает уникальный идентификатор настройки МЧД.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки.
//
Функция УИД_НастройкаМЧД() Экспорт
	
	Возврат Новый УникальныйИдентификатор("28ce18c0-fa85-4db6-82bf-2f374634981b");
	
КонецФункции

// Возвращает уникальный идентификатор настройки поиска контрагентов для синхронизации с Курьером.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор настройки.
//
Функция УИД_НастройкаПоискаКонтрагентов() Экспорт
	
	Возврат Новый УникальныйИдентификатор("6aec7166-cf85-4096-9817-9bdafce67adb");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает результат проверки корректности типа значения параметра.
//
// Параметры:
//  ПроверяемоеЗначение	 - Произвольный	 - Переданное значение параметра.
//  ДопустимыйТип		 - Тип			 - Ожидаемый тип параметра.
// 
// Возвращаемое значение:
//  Структура - :
//  * Результат   - Неопределено
//  * Успех       - Булево    - Успешность проверки корректности.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция КорректностьТипаПараметра(ПроверяемоеЗначение, ДопустимыйТип)
	
	ТекстШаблона = "Проверка корректности значения параметра %1.";
	ЗаголовокЖурнала = СтрШаблон(ТекстШаблона, ПроверяемоеЗначение);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ТипЗначения = ТипЗнч(ПроверяемоеЗначение);
	Если ТипЗначения <> ДопустимыйТип Тогда
		ТекстШаблона = "Некорректное значение параметра %1.";
		СобытиеОшибки = СтрШаблон(ТекстШаблона, ПроверяемоеЗначение);
		КодОшибки = "SETT-00003";
		ТекстШаблона = "Значение параметра должно быть типа %1. Передан параметр типа %2.";
		КомментарийОшибки = СтрШаблон(ТекстШаблона, Строка(ДопустимыйТип), ТипЗначения);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
	Иначе
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает поддерживаемые варианты группировки расширенного экспорта.
// 
// Возвращаемое значение:
//  ПоддерживаемыеГруппировки - Массив из Строка:
//  "ПоКонтрагентам" - группировка по контрагентам;
//  "ПоПериоду" - группировка по периоду.
//
Функция ПоддерживаемыеГруппировкиРасширенногоЭкспорта()
	
	ПоддерживаемыеГруппировки = Новый Массив;
	ПоддерживаемыеГруппировки.Добавить("ПоКонтрагентам");
	ПоддерживаемыеГруппировки.Добавить("ПоПериоду");
	
	Возврат ПоддерживаемыеГруппировки;
	
КонецФункции

// Возвращает поддерживаемые типы документов расширенного экспорта.
// 
// Возвращаемое значение:
//  ПоддерживаемыеТипыДокументов - Массив строк:
//  "УПД:Первичный документ" - УПД ДОП;
//  "УПД:Счет-фактура" - УПД СЧФ;
//  "УПД:Счет-фактура и первичный документ" - УПД СЧФДОП;
//  "УКД:Первичный документ" - УКД ДОП;
//  "УКД:Корректировочный счет-фактура" - УКД КСЧФ;
//  "УКД:Корректировочный счет-фактура и первичный документ" - УКД КСЧФДОП;
//
Функция ПоддерживаемыеТипыДокументовРасширенногоЭкспорта()
	
	ПоддерживаемыеТипыДокументов = Новый Массив;
	ПоддерживаемыеТипыДокументов.Добавить("УПД:Первичный документ");
	ПоддерживаемыеТипыДокументов.Добавить("УПД:Счет-фактура");
	ПоддерживаемыеТипыДокументов.Добавить("УПД:Счет-фактура и первичный документ");
	ПоддерживаемыеТипыДокументов.Добавить("УКД:Первичный документ");
	ПоддерживаемыеТипыДокументов.Добавить("УКД:Корректировочный счет-фактура");
	ПоддерживаемыеТипыДокументов.Добавить("УКД:Корректировочный счет-фактура и первичный документ");
	
	Возврат ПоддерживаемыеТипыДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
